Revit 2027 API
PresetInitialColor(ColorPreset) Constructor
 Creates an initial color preset object with the given preset value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PresetInitialColor(
	ColorPreset presetIn
)
Public Sub New (
	presetIn As ColorPreset
)
public:
PresetInitialColor(
	ColorPreset presetIn
)
new :
        presetIn : ColorPreset -> PresetInitialColor
Parameters
presetIn ColorPreset
 The enum value which determines the preset value
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PresetInitialColor Class
PresetInitialColor Overload
Autodesk.Revit.DB.Lighting Namespace